* exercise 02
** C
#+begin_src python :results output
  import requests

  def pedido(limit, offset):
      url = f'https://transparencia.sns.gov.pt/api/explore/v2.1/catalog/datasets?limit={limit}&offset={offset}'
      res = requests.get(url)
      myDict = {}
      if res.status_code == 200:
          results = res.json()
          for i in range(0, len(results['results'])):
              myDict[results['results'][i]['dataset_id']] = results['results'][i]['has_records']
          return myDict
      else:
          print(f'Error {res.status_code} - {res.text}')
          return {}

  print(pedido(100,0))


#+RESULTS:
: {'distribuicao-da-reserva-estrategica-de-medicamentos': True, 'morbilidade-e-mortalidade-hospitalar-asma-dpoc-pneumo': True, 'morbilidade-e-mortalidade-hospitalar-hipertensao-insuf-cardiaca': True, 'stock-reserva-estrategica-equipamentos-de-proteccao-individual-epi-e-dispositvos': True, 'normas-de-orientacao-clinica-pelas-unidades-de-saude': True, 'contagem-das-horas-de-trabalho-nocturno-normal-e-extraordinario': True, 'despesa-com-medicamentos-no-ambulatorio-sns': True, 'evolucao-programas-dae-licenciados-em-espacos-publicos': True, 'evolucao-mensal-das-consultas-de-psicologia': True, 'distribuicao-da-reserva-estrategica-equipamentos-de-proteccao-individual-epi-e-d': True, 'sns24': True, 'custo-de-tratamento-mensal-por-doente': True, 'evolucao-programas-dae-em-meios-de-emergencia-medica': True, 'evolucao-mensal-distribuicao-novo-coronavirus-2019-n-cov-para-extracao-de-rna-e-': True, 'acreditacao-de-unidades-de-saude': True, 'utentes-referenciados-pelos-hospitais-e-cs-para-a-rede': True, 'atividade-de-pedidos-de-avaliacao-previa-de-medicamentos-para-utilizacao-hospita': True, 'acesso-de-consultas-medicas-pela-populacao-inscrita': True, 'inscritos-na-area-pessoal-do-sns24': True, 'distribuicao-do-destino-das-altas': True, 'medicamentos-biossimilares': True, 'genericos': True, 'agregados-economico-financeiros': True, 'frequencia-de-casos-confirmados-de-gripe': True, 'morbilidade-e-mortalidade-hospitalar-por-sexo': True, 'evolucao-enfarte-agudo-miocardio-supra-desnivelamento': True, 'evolucao-mensal-das-consultas-de-nutricao': True, 'dispensa-de-medicamentos-por-grupo-farmacoterapeutico': True, 'evolucao-da-prescricao-electronica-de-medicamentos': True, 'portal-base': True, 'utentes-atendidos-nos-centros-de-saude-no-ambito-da-soep': True, 'consultas-em-telemedicina': True, 'atividade-gripe-inem': True, 'dadores-de-sangue': True, 'evolucao-da-dispensa-de-medicamentos': True, 'inscritos-em-lic-dentro-do-tmrg-180-dias': True, 'custos-com-he-e-suplementos': True, 'saude-oral': True, 'acordos-quadro-na-area-da-saude': True, 'conta-do-servico-nacional-de-saude': True, 'inscritos-lic-dentro-tmrg': True, 'evolucao-do-numero-de-unidades-funcionais': True, 'evolucao-das-consultas-medicas-nos-csp': True, 'contagem-dos-dias-de-ausencia-ao-trabalho-segundo-o-motivo-de-ausencia': True, 'hipertensao': True, 'rastreios-oncologicos': True, 'gestao-integrada-da-doenca-insuficiencia-renal-cronica': True, 'lotacao-praticada-por-tipo-de-cama': True, 'colheita-de-sangue-total': True, 'dados-financeiros': True, 'ausencias-para-formacao-e-aperfeicoamento-profissional': True, 'trabalhadores-por-grupo-profissional': True, 'atendimentos-nos-csp-gripe': True, 'utentes-isentos': True, 'atendimentos-em-urgencia-triagem-manchester': True, 'termos-de-responsabilidade': True, 'informacoes-de-custo-emitidas-mensalmente': True, 'doencas-de-declaracao-obrigatoria': True, 'atividade-sindrome-gripal-csh': True, 'existencias-de-medicos-especialistas-e-previsao-de-aposentacoes': True, 'partos-e-cesarianas': True, 'atendimentos-por-tipo-de-urgencia-hospitalar-link': True, 'morbilidade_mortalidade_hospit': True, 'numero-de-ocorrencia-com-prioridade': True, 'saude-da-mulher-e-crianca': True, 'ocupacao-do-internamento': True, 'percentagem-de-gastos-com-te-e-suplementos-no-total-gastos-com-pessoal': True, 'utentes-admitidos-e-referenciados': True, 'divida-total-vencida-e-pagamentos': True, 'atividade-operacional-do-sns-24': True, 'evolucao-de-mcdt-realizados-no-convencionado': True, 'diabetes': True, 'incidencia-semanal-de-sindrome-gripal': True, 'utilizacao-de-registo-saude-eletronico-por-profissionais-de-saude-em-csp': True, 'utentes-novos-em-ambulatorio': True, 'top-50-de-prescricao-rsp-em-locais-nao-sns': True, 'satisfacao-do-utente-em-atendimento-telefonico': True, 'orgaos-colhidos-e-transplantados': True, 'atividade-de-pedidos-de-processos-para-comparticipacao-de-medicamentos-de-uso-hu': True, 'dadores-vivos-e-falecidos': True, 'acionamentos-dos-meios-de-emergencia-medica-pre-hospitalar': True, 'evolucao-mensal-stock-novo-coronavirus-2019-n-cov-para-extracao-de-rna-e-rt-pcr-': True, 'episodios-de-internamento-com-dispositivos-medicos': True, 'frequencia-de-casos-de-sindrome-gripal-devido-a-infecao-por-outros-virus-respira': True, 'chamadas-capic': True, 'atividade-de-pedidos-de-comparticipacao-de-medicamentos-de-uso-humano': True, 'no-de-entidades-inspecionadas-auditadas': True, 'evolucao-mensal-do-no-de-chamadas-atendidas-no-centro-de-informacao-antivenenos': True, 'trabalhadores-por-modalidade-de-vinculacao': True, 'orgaos-colhidos': True, 'stock-da-reserva-estrategica-de-medicamentos-existentes-a-nivel-central': True, 'codu-mar': True, 'registo-nacional-de-anomalias-congenitas': True, 'tratamentos-efetuados-no-ambito-soep': True, 'notificacao-de-incidentes-de-seguranca-em-unidades-prestadoras-de-cuidados-de-sa': True, 'referenciacoes-soep-emitidas-nos-centros-de-saude': True, 'processos-de-inquerito-arguidos-e-tipologia-de-crimes-investigados-pela-policia-': True, 'dispositivos-medicos-por-nomenclatura-portuguesa-do-dispositivo-medico': True, 'evolucao-situacoes-doentes-sinais-sintomas-de-avc': True, 'morbilidade-e-mortalidade-hospitalar-por-faixa-etaria': True}

** D
#+name: API_dictionary
#+begin_src python :results output
  import requests

  def pedido():
      limit = 100
      offset = 0
      url = f'https://transparencia.sns.gov.pt/api/explore/v2.1/catalog/datasets?limit={limit}&offset={offset}'
      res = requests.get(url)
      myDict = {}
      while offset < 200:
          url = f'https://transparencia.sns.gov.pt/api/explore/v2.1/catalog/datasets?limit={limit}&offset={offset}'
          res = requests.get(url)
          if res.status_code == 200:
              results = res.json()
              for i in range(0, len(results['results'])):
                  myDict[results['results'][i]['dataset_id']] = results['results'][i]['has_records']
          else:
              print(f'Error {res.status_code} - {res.text}')
          offset += limit
      return myDict

  myDict = pedido()
  print(myDict)
#+end_src

#+RESULTS: API_dictionary
: {'distribuicao-da-reserva-estrategica-de-medicamentos': True, 'morbilidade-e-mortalidade-hospitalar-asma-dpoc-pneumo': True, 'morbilidade-e-mortalidade-hospitalar-hipertensao-insuf-cardiaca': True, 'stock-reserva-estrategica-equipamentos-de-proteccao-individual-epi-e-dispositvos': True, 'normas-de-orientacao-clinica-pelas-unidades-de-saude': True, 'contagem-das-horas-de-trabalho-nocturno-normal-e-extraordinario': True, 'despesa-com-medicamentos-no-ambulatorio-sns': True, 'evolucao-mensal-das-consultas-de-psicologia': True, 'distribuicao-da-reserva-estrategica-equipamentos-de-proteccao-individual-epi-e-d': True, 'evolucao-programas-dae-licenciados-em-espacos-publicos': True, 'evolucao-programas-dae-em-meios-de-emergencia-medica': True, 'evolucao-mensal-distribuicao-novo-coronavirus-2019-n-cov-para-extracao-de-rna-e-': True, 'utentes-referenciados-pelos-hospitais-e-cs-para-a-rede': True, 'atividade-de-pedidos-de-avaliacao-previa-de-medicamentos-para-utilizacao-hospita': True, 'acesso-de-consultas-medicas-pela-populacao-inscrita': True, 'inscritos-na-area-pessoal-do-sns24': True, 'medicamentos-biossimilares': True, 'genericos': True, 'agregados-economico-financeiros': True, 'frequencia-de-casos-confirmados-de-gripe': True, 'morbilidade-e-mortalidade-hospitalar-por-sexo': True, 'evolucao-enfarte-agudo-miocardio-supra-desnivelamento': True, 'evolucao-mensal-das-consultas-de-nutricao': True, 'dispensa-de-medicamentos-por-grupo-farmacoterapeutico': True, 'inscritos-em-lic-dentro-do-tmrg-180-dias': True, 'custos-com-he-e-suplementos': True, 'saude-oral': True, 'acordos-quadro-na-area-da-saude': True, 'conta-do-servico-nacional-de-saude': True, 'inscritos-lic-dentro-tmrg': True, 'evolucao-das-consultas-medicas-nos-csp': True, 'hipertensao': True, 'gestao-integrada-da-doenca-insuficiencia-renal-cronica': True, 'colheita-de-sangue-total': True, 'dados-financeiros': True, 'termos-de-responsabilidade': True, 'informacoes-de-custo-emitidas-mensalmente': True, 'doencas-de-declaracao-obrigatoria': True, 'numero-de-ocorrencia-com-prioridade': True, 'saude-da-mulher-e-crianca': True, 'ocupacao-do-internamento': True, 'evolucao-de-mcdt-realizados-no-convencionado': True, 'diabetes': True, 'incidencia-semanal-de-sindrome-gripal': True, 'evolucao-da-dispensa-de-medicamentos': True, 'evolucao-do-numero-de-unidades-funcionais': True, 'distribuicao-do-destino-das-altas': True, 'ausencias-para-formacao-e-aperfeicoamento-profissional': True, 'acreditacao-de-unidades-de-saude': True, 'contagem-dos-dias-de-ausencia-ao-trabalho-segundo-o-motivo-de-ausencia': True, 'trabalhadores-por-grupo-profissional': True, 'utentes-isentos': True, 'existencias-de-medicos-especialistas-e-previsao-de-aposentacoes': True, 'atendimentos-em-urgencia-triagem-manchester': True, 'partos-e-cesarianas': True, 'atendimentos-por-tipo-de-urgencia-hospitalar-link': True, 'sns24': True, 'percentagem-de-gastos-com-te-e-suplementos-no-total-gastos-com-pessoal': True, 'consultas-em-telemedicina': True, 'morbilidade_mortalidade_hospit': True, 'divida-total-vencida-e-pagamentos': True, 'custo-de-tratamento-mensal-por-doente': True, 'atividade-gripe-inem': True, 'evolucao-da-prescricao-electronica-de-medicamentos': True, 'lotacao-praticada-por-tipo-de-cama': True, 'dadores-de-sangue': True, 'portal-base': True, 'utentes-atendidos-nos-centros-de-saude-no-ambito-da-soep': True, 'rastreios-oncologicos': True, 'utentes-admitidos-e-referenciados': True, 'utilizacao-de-registo-saude-eletronico-por-profissionais-de-saude-em-csp': True, 'atividade-operacional-do-sns-24': True, 'top-50-de-prescricao-rsp-em-locais-nao-sns': True, 'atividade-sindrome-gripal-csh': True, 'atendimentos-nos-csp-gripe': True, 'utentes-novos-em-ambulatorio': True, 'orgaos-colhidos-e-transplantados': True, 'atividade-de-pedidos-de-processos-para-comparticipacao-de-medicamentos-de-uso-hu': True, 'acionamentos-dos-meios-de-emergencia-medica-pre-hospitalar': True, 'evolucao-mensal-stock-novo-coronavirus-2019-n-cov-para-extracao-de-rna-e-rt-pcr-': True, 'episodios-de-internamento-com-dispositivos-medicos': True, 'frequencia-de-casos-de-sindrome-gripal-devido-a-infecao-por-outros-virus-respira': True, 'chamadas-capic': True, 'atividade-de-pedidos-de-comparticipacao-de-medicamentos-de-uso-humano': True, 'no-de-entidades-inspecionadas-auditadas': True, 'trabalhadores-por-modalidade-de-vinculacao': True, 'orgaos-colhidos': True, 'codu-mar': True, 'tratamentos-efetuados-no-ambito-soep': True, 'notificacao-de-incidentes-de-seguranca-em-unidades-prestadoras-de-cuidados-de-sa': True, 'referenciacoes-soep-emitidas-nos-centros-de-saude': True, 'processos-de-inquerito-arguidos-e-tipologia-de-crimes-investigados-pela-policia-': True, 'evolucao-situacoes-doentes-sinais-sintomas-de-avc': True, 'morbilidade-e-mortalidade-hospitalar-por-faixa-etaria': True, 'ocorrencias-pre-hospitalares': True, 'preco-medio-por-embalagem': True, 'poupancas-obtidas-nos-processos-compras-bens-servicos-transversais': True, 'reservas': True, 'consultas-em-tempo-real': True, 'taxa-de-mortalidade-por-avc-isquemico-e-hemorragico': True, 'ensaios-clinicos': True, 'cartao-da-pessoa-com-doenca-rara': True, 'evolucao-anual-do-numero-de-transportes': True, 'fornecimentos-e-servicos-externos-nas-instituicoes-sns': True, 'taxa-de-cobertura-da-vacina-antigripal-sazonal-na-populacao-em-portugal-continen': True, 'cirurgias-em-ambulatorio': True, 'acordos-quadro-sistemas-aquisicao-dinamicos-ativos': True, 'registo-de-testamentos-vitais': True, 'intervencoes-cirurgicas': True, 'monitorizacao-ambiental-de-legionella': True, 'noticias-de-nascimento-digital-e-registo-de-nascer-de-utentes': True, 'fraturas-da-anca-cirurgias-nas-primeiras-48h': True, 'antibioticos-fluoroquinolonas': True, 'tempo-medio-de-pagamento-das-instituicoes-do-sns-a-fornecedores': True, 'evolucao-diaria-de-certificados-de-obito': True, 'atividade-de-internamento-hospitalar': True, 'antibioticos-cefalosporinas': True, 'antibioticos-carbapenemes': True, 'auditorias-internas': True, 'programa-nacional-de-diagnostico-precoce': True, 'mapeamento-entre-codigos-de-centros-de-custo-usados-no-rhv-e-codigos-da-hierarqu': True, 'certificados-de-obito-por-instituicao-de-saude': True, 'morbilidade-e-mortalidade-hospitalar': True, 'teleconsultas-atraves-da-plataforma-live': True, 'taxa-de-incidencia-de-diabetes': True, 'demora-media-antes-da-cirurgia': True, 'prestadores-de-servicos-medicos': True, 'acionamentos-de-meios-de-emergencia-medica': True, 'antibioticos': True, 'indice-friesa': True, 'evolucao-diaria-do-indice-icaro': True, 'rncci-episodios': True, 'dadores-vivos-e-falecidos': True, '01_sica_evolucao-mensal-das-consultas-medicas-hospitalares': True, 'evolucao-mensal-do-no-de-chamadas-atendidas-no-centro-de-informacao-antivenenos': True, 'stock-da-reserva-estrategica-de-medicamentos-existentes-a-nivel-central': True, 'morbilidade-e-mortalidade-hospitalar-diabetes': True, 'exames-convencionados-e-area-mcdt': True, 'dispositivos-medicos-por-nomenclatura-portuguesa-do-dispositivo-medico': True, 'caracterizacao-das-valencias-de-urgencia': True, 'registo-nacional-de-anomalias-congenitas': True, 'vacinacao': True, 'utentes-inscritos-em-cuidados-de-saude-primarios': True, 'despesa-com-medicamentos-nos-hospitais-do-sns': True, 'evolucao-mensal-das-ocorrencias-pre-hospitalares-por-tipologia': True, 'evolucao-dos-contactos-de-enfermagem-nos-csp': True, 'poupancas-obtidas-nos-processos-compras-bens-servicos-saude': True, 'consumo': True, 'prevalencia-de-quedas-e-incidencias-de-ulceras-de-pressao': True, 'satisfacao-do-utente-em-atendimento-telefonico': True, 'desmaterializacao-eletronica-da-receita': True, 'utilizacao-de-registo-saude-eletronico-por-profissionais-de-saude-em-hospitais-q': True, 'substancias': True, 'movimento-clinico-de-utentes-com-problemas-de-comportamentos-aditivos-e-dependen': True, 'dissuasao-da-toxicodependencia': True, 'monitorizacao-sazonal-csh': True, 'monitorizacao-sazonal-csp': True}

#+RESULTS:
: 157

** E
#+begin_src python :var newDict=API_dictionary :results output
  import requests
  import re
  import csv

  def pedido():
      limit = 100
      offset = 0
      url = f'https://transparencia.sns.gov.pt/api/explore/v2.1/catalog/datasets?limit={limit}&offset={offset}'
      res = requests.get(url)
      myDict = {}
      while offset < 200:
          url = f'https://transparencia.sns.gov.pt/api/explore/v2.1/catalog/datasets?limit={limit}&offset={offset}'
          res = requests.get(url)
          if res.status_code == 200:
              results = res.json()
              for i in range(0, len(results['results'])):
                  cleanKey = re.sub(r'-', ' ' , results['results'][i]['dataset_id'])
                  myDict[cleanKey] = results['results'][i]['has_records']
          else:
              print(f'Error {res.status_code} - {res.text}')
          offset += limit
      return myDict

  myDict = pedido()

  with open('mycsvfile.csv', 'w', newline='\n') as f:
      columns = ['id', 'has records']
      w = csv.DictWriter(f, myDict.keys())
      w.writeheader()
      for key, value in myDict.items():
          w.writerow({'id': key, 'has records': value})


#+end_src

#+RESULTS:
